Repository: GigaDuckAI/conduck
Catalog: Conduck/Conduck/Localizable.xcstrings
Source language: en
Languages: es, ja, zh_hans

# settings.remoteAgent.customHelp.done
source: Done
es: Listo
ja: 完了
zh_hans: 完成

# settings.remoteAgent.customHelp.intro
source: Both values describe your own server. Pick the situation that matches yours.
es: Ambos valores describen tu propio servidor. Elige la situación que coincida con la tuya.
ja: どちらも自分のサーバーの情報です。状況に合うものを選んでください。
zh_hans: 两项都描述你自己的服务器，请选择与你相符的情况。

# settings.remoteAgent.customHelp.title
source: What do I enter?
es: ¿Qué introduzco?
ja: 何を入力しますか？
zh_hans: 应填写什么？

# settings.remoteAgent.delete.button
source: Delete
es: Eliminar
ja: 削除
zh_hans: 删除

# settings.remoteAgent.devices.header
source: Devices
es: Dispositivos
ja: デバイス
zh_hans: 设备

# settings.remoteAgent.endpointDisabled.title
source: Most likely: the AI endpoint is switched off
es: Lo más probable: el punto de conexión de IA está desactivado
ja: AIエンドポイントが無効になっている可能性があります
zh_hans: 最可能的原因：AI 端点未开启

# settings.remoteAgent.error.capReached
source: You've reached the custom-gateway limit. Delete one to add another.
es: Has alcanzado el límite de pasarelas personalizadas. Elimina una para añadir otra.
ja: カスタムゲートウェイの上限に達しています。別のゲートウェイを追加するには1つ削除してください。
zh_hans: 已达到自定义网关上限，请删除一个后再添加。

# settings.remoteAgent.fileTransfer.gate.dirty
source: Save or discard your changes first.
es: Primero guarda o descarta tus cambios.
ja: まず変更を保存するか破棄してください。
zh_hans: 请先保存或放弃更改。

# settings.remoteAgent.fileTransfer.gate.unsaved
source: Save this gateway before setting up file transfer.
es: Guarda esta pasarela antes de configurar la transferencia de archivos.
ja: ファイル転送を設定する前に、このゲートウェイを保存してください。
zh_hans: 请先保存此网关，再设置文件传输。

# settings.remoteAgent.fileTransfer.row.label
source: File transfer
es: Transferencia de archivos
ja: ファイル転送
zh_hans: 文件传输

# settings.remoteAgent.fingerprint.helper
source: Leave empty for default system trust. To pin: openssl x509 -pubkey -in cert.pem | openssl pkey -pubin -outform DER | shasum -a 256
es: Déjalo vacío para usar la confianza predeterminada del sistema. Para fijar la huella: openssl x509 -pubkey -in cert.pem | openssl pkey -pubin -outform DER | shasum -a 256
ja: 通常のシステムによる信頼確認を使うには空欄にします。固定するには：openssl x509 -pubkey -in cert.pem | openssl pkey -pubin -outform DER | shasum -a 256
zh_hans: 留空以使用默认系统信任验证。固定指纹命令：openssl x509 -pubkey -in cert.pem | openssl pkey -pubin -outform DER | shasum -a 256

# settings.remoteAgent.fingerprint.helperShort.v2
source: Optional. Conduck already refuses any certificate this device doesn't trust; a fingerprint narrows that to one exact certificate. Leave it empty unless you have a reason.
es: Opcional. Conduck ya rechaza cualquier certificado en el que este dispositivo no confíe; una huella limita la aceptación a un certificado exacto. Déjalo vacío salvo que tengas un motivo.
ja: 任意です。Conduckは、このデバイスが信頼しない証明書をすでに拒否します。フィンガープリントを指定すると、特定の証明書だけに限定されます。必要がなければ空欄にしてください。
zh_hans: 可选。Conduck 已拒绝此设备不信任的证书，指纹会进一步限定为一个确切证书。除非有明确需要，否则请留空。

# settings.remoteAgent.fingerprint.invalid
source: That fingerprint should be 64 hex characters.
es: Esa huella debe tener 64 caracteres hexadecimales.
ja: フィンガープリントは16進数64文字である必要があります。
zh_hans: 指纹应为 64 个十六进制字符。

# settings.remoteAgent.fingerprint.label
source: Pinned cert fingerprint
es: Huella fijada del certificado
ja: 固定する証明書フィンガープリント
zh_hans: 固定的证书指纹

# settings.remoteAgent.fingerprint.placeholder
source: SHA-256 hex (optional)
es: SHA-256 hexadecimal (opcional)
ja: SHA-256の16進数（任意）
zh_hans: SHA-256 十六进制值（可选）

# settings.remoteAgent.forgetAlert.cancel
source: Cancel
es: Cancelar
ja: キャンセル
zh_hans: 取消

# settings.remoteAgent.forgetAlert.confirm
source: Forget
es: Olvidar
ja: 登録解除
zh_hans: 移除设置

# settings.remoteAgent.forgetAlert.message
source: Conduck will erase the saved URL, token, and pin, plus any file-transfer setup for this gateway (server address and generated password). The URL and token are removed from all your devices signed in to iCloud; the pin is only on this one. You'll re-enter them next time.
es: Conduck borrará la URL guardada, el token y la huella fijada, además de la configuración de transferencia de archivos de esta pasarela (dirección del servidor y contraseña generada). La URL y el token se eliminan de todos tus dispositivos con sesión iniciada en iCloud; la huella fijada solo está en este. Tendrás que volver a introducirlos.
ja: 保存したURL、認証トークン、固定したフィンガープリント、およびこのゲートウェイのファイル転送設定（サーバーアドレスと生成したパスワード）を削除します。URLと認証トークンはiCloudにサインインしたすべてのデバイスから削除され、フィンガープリントはこのデバイスからのみ削除されます。次回は再入力が必要です。
zh_hans: Conduck 将清除已保存的 URL、令牌和固定指纹，以及此网关的文件传输设置（服务器地址和生成的密码）。URL 和令牌会从所有登录 iCloud 的设备移除，固定指纹仅存于此设备。下次需要重新输入。

# settings.remoteAgent.forgetAlert.message.custom.retained.v2
source: Conduck will delete this gateway and its saved URL, key, and pin, plus any file-transfer setup for it (server address and generated password). The URL and key are removed from all your devices signed in to iCloud; the pin is only on this one. Conversations bound to it stay readable but can't send new turns. They keep this gateway's colour tag so you can still tell them apart; its name is not kept.
es: Conduck eliminará esta pasarela y su URL, clave y huella fijada guardadas, además de su configuración de transferencia de archivos (dirección del servidor y contraseña generada). La URL y la clave se eliminan de todos tus dispositivos con sesión iniciada en iCloud; la huella fijada solo está en este. Las conversaciones vinculadas seguirán siendo legibles, pero no podrán enviar nuevos turnos. Conservarán el color de esta pasarela para que puedas distinguirlas; su nombre no se conserva.
ja: このゲートウェイと、保存したURL、キー、固定したフィンガープリント、およびファイル転送設定（サーバーアドレスと生成したパスワード）を削除します。URLとキーはiCloudにサインインしたすべてのデバイスから削除され、フィンガープリントはこのデバイスからのみ削除されます。関連付けられた会話は読めますが、新しいメッセージを送れません。区別できるように色は保持しますが、名前は保持しません。
zh_hans: Conduck 将删除此网关及其已保存的 URL、密钥、固定指纹和文件传输设置（服务器地址和生成的密码）。URL 和密钥会从所有登录 iCloud 的设备移除，固定指纹仅存于此设备。绑定的对话仍可阅读，但无法发送新消息。对话保留此网关的颜色标记以便区分，不保留名称。

# settings.remoteAgent.forgetAlert.message.hosted
source: Conduck will erase the saved API key. It's removed from all your devices signed in to iCloud, not just this one. You'll re-enter it next time.
es: Conduck borrará la clave de API guardada. Se elimina de todos tus dispositivos con sesión iniciada en iCloud, no solo de este. Tendrás que volver a introducirla.
ja: 保存したAPIキーを削除します。このデバイスだけでなく、iCloudにサインインしたすべてのデバイスから削除されます。次回は再入力が必要です。
zh_hans: Conduck 将清除已保存的 API 密钥。它会从所有登录 iCloud 的设备移除，而非仅此设备。下次需要重新输入。

# settings.remoteAgent.forgetAlert.message.v2
source: Conduck will erase the saved URL, key, and pin, plus any file-transfer setup for this gateway (server address and generated password). The URL and key are removed from all your devices signed in to iCloud; the pin is only on this one. You'll re-enter them next time.
es: Conduck borrará la URL guardada, la clave y la huella fijada, además de la configuración de transferencia de archivos de esta pasarela (dirección del servidor y contraseña generada). La URL y la clave se eliminan de todos tus dispositivos con sesión iniciada en iCloud; la huella fijada solo está en este. Tendrás que volver a introducirlas.
ja: 保存したURL、キー、固定したフィンガープリント、およびこのゲートウェイのファイル転送設定（サーバーアドレスと生成したパスワード）を削除します。URLとキーはiCloudにサインインしたすべてのデバイスから削除され、フィンガープリントはこのデバイスからのみ削除されます。次回は再入力が必要です。
zh_hans: Conduck 将清除已保存的 URL、密钥和固定指纹，以及此网关的文件传输设置（服务器地址和生成的密码）。URL 和密钥会从所有登录 iCloud 的设备移除，固定指纹仅存于此设备。下次需要重新输入。

# settings.remoteAgent.forgetAlert.title.v2
source: Forget %@?
es: ¿Olvidar %@?
ja: %@の登録を解除しますか？
zh_hans: 移除 %@ 的设置？

# settings.remoteAgent.freeLimit.message
source: Your free plan includes three active gateways. Upgrade to Pro for unlimited gateways, or manage your free selection. OpenRouter is always available.
es: Tu plan gratuito incluye tres pasarelas activas. Pasa a Pro para tener pasarelas ilimitadas o gestiona tu selección gratuita. OpenRouter siempre está disponible.
ja: 無料プランには有効なゲートウェイ3つが含まれます。Proなら無制限に使えます。無料プランの選択を変更することもできます。OpenRouterは常に利用できます。
zh_hans: 免费方案包含三个启用的网关。升级 Pro 可使用不限数量的网关，或管理免费方案的选择。OpenRouter 始终可用。

# settings.remoteAgent.guided.hosted.link
source: Get an API key
es: Obtener una clave de API
ja: APIキーを取得
zh_hans: 获取 API 密钥

# settings.remoteAgent.hosted.edit.replaceKey.placeholder
source: Replace API key
es: Reemplazar clave de API
ja: APIキーを置き換え
zh_hans: 替换 API 密钥

# settings.remoteAgent.hostedModels.header
source: Hosted models
es: Modelos alojados
ja: ホスト型モデル
zh_hans: 托管模型

# settings.remoteAgent.imageHistory.caption.all
source: Re-sends every recent image message in full each turn. Most expensive; long image chats may hit size limits.
es: Reenvía completos todos los mensajes recientes con imágenes en cada turno. Es la opción más cara; los chats largos con imágenes pueden alcanzar límites de tamaño.
ja: 各ターンで最近の画像メッセージをすべて再送します。料金が最も高く、画像の多い長いチャットはサイズ上限に達することがあります。
zh_hans: 每轮重新完整发送近期所有图片消息。费用最高，较长的图片对话可能达到大小限制。

# settings.remoteAgent.imageHistory.caption.extended
source: Sees your last 10 image messages in full. Slower and pricier on image-heavy chats.
es: Ve completos tus últimos 10 mensajes con imágenes. Es más lento y caro en chats con muchas imágenes.
ja: 直近10件の画像メッセージを完全に送信します。画像の多いチャットでは速度が遅く、料金も高くなります。
zh_hans: 完整查看最近 10 条图片消息。图片较多时更慢且费用更高。

# settings.remoteAgent.imageHistory.caption.recent
source: Fastest and cheapest. The agent sees your last 3 image messages in full; older uploaded images become file references.
es: La opción más rápida y barata. El agente ve completos tus últimos 3 mensajes con imágenes; las imágenes subidas anteriores pasan a ser referencias de archivo.
ja: 最速・最安です。エージェントには直近3件の画像メッセージを完全に送り、それ以前のアップロード画像はファイル参照になります。
zh_hans: 最快且费用最低。智能体完整查看最近 3 条图片消息，更早上传的图片将变为文件引用。

# settings.remoteAgent.imageHistory.label
source: Image history
es: Historial de imágenes
ja: 画像の履歴
zh_hans: 图片历史

# settings.remoteAgent.imageHistory.option.all
source: All
es: Todo
ja: すべて
zh_hans: 全部

# settings.remoteAgent.imageHistory.option.extended
source: Extended
es: Ampliado
ja: 拡張
zh_hans: 扩展

# settings.remoteAgent.imageHistory.option.recent
source: Recent
es: Reciente
ja: 最近
zh_hans: 最近

# settings.remoteAgent.inChats.footer
source: Changes here apply immediately.
es: Los cambios aquí se aplican inmediatamente.
ja: 変更はすぐに適用されます。
zh_hans: 更改立即生效。

# settings.remoteAgent.inChats.header
source: In chats
es: En los chats
ja: チャット内
zh_hans: 对话中

# settings.remoteAgent.keylessPublic.body
source: Without a token, anyone who can reach this address can use your AI and its tools. Turn the token back on, or move the gateway onto a private network like Tailscale. If this address is already private (a Tailscale or internal name), you can ignore this.
es: Sin token, cualquiera que pueda acceder a esta dirección puede usar tu IA y sus herramientas. Vuelve a activar el token o mueve la pasarela a una red privada como Tailscale. Si esta dirección ya es privada (un nombre de Tailscale o interno), puedes ignorar esto.
ja: 認証トークンがないと、このアドレスに接続できる人は誰でもAIとそのツールを使えます。認証トークンを再び有効にするか、Tailscaleなどの非公開ネットワークにゲートウェイを移してください。アドレスがすでに非公開（Tailscale名や内部名）の場合は、この通知を無視できます。
zh_hans: 没有令牌时，任何能够访问此地址的人都能使用你的 AI 及其工具。请重新开启令牌，或将网关放到 Tailscale 等私有网络中。如果地址已属于私有网络（Tailscale 或内部名称），可忽略此提示。

# settings.remoteAgent.keylessPublic.title
source: This address appears public
es: Esta dirección parece pública
ja: このアドレスは公開されているようです
zh_hans: 此地址似乎是公共地址

# settings.remoteAgent.list.pill.default
source: Default
es: Predeterminada
ja: デフォルト
zh_hans: 默认

# settings.remoteAgent.makeDefault.confirm
source: Make Default
es: Establecer como predeterminada
ja: デフォルトに設定
zh_hans: 设为默认

# settings.remoteAgent.makeDefault.message
source: New chats start here. Existing chats keep their gateway.
es: Los chats nuevos empiezan aquí. Los chats existentes conservan su pasarela.
ja: 新しいチャットはここで始まります。既存のチャットはゲートウェイを保持します。
zh_hans: 新对话使用此网关，现有对话保持原来的网关。

# settings.remoteAgent.makeDefault.notNow
source: Not Now
es: Ahora no
ja: 今はしない
zh_hans: 暂不

# settings.remoteAgent.makeDefault.title
source: Make %@ your default gateway?
es: ¿Establecer %@ como tu pasarela predeterminada?
ja: %@をデフォルトのゲートウェイにしますか？
zh_hans: 将 %@ 设为默认网关？

# settings.remoteAgent.model.header
source: Model
es: Modelo
ja: モデル
zh_hans: 模型

# settings.remoteAgent.model.helper
source: Leave blank to let your gateway choose. Ollama and vLLM usually need a model ID running on your server, e.g. 'llama3'.
es: Déjalo vacío para que tu pasarela elija. Ollama y vLLM suelen necesitar el ID de un modelo que se ejecute en tu servidor, p. ej., 'llama3'.
ja: 空欄にするとゲートウェイが選びます。OllamaやvLLMでは通常、サーバーで稼働するモデルID（例：'llama3'）が必要です。
zh_hans: 留空以让网关选择。Ollama 和 vLLM 通常需要服务器上正在运行的模型 ID，例如 'llama3'。

# settings.remoteAgent.model.helper.hosted.onboarding
source: Validate your key to load the model list, or type a model ID.
es: Valida tu clave para cargar la lista de modelos o escribe un ID de modelo.
ja: キーを検証してモデル一覧を読み込むか、モデルIDを入力してください。
zh_hans: 验证密钥以载入模型列表，或输入模型 ID。

# settings.remoteAgent.model.helper.hosted.v2
source: Add :floor to a model ID for the cheapest provider, or :nitro for the fastest.
es: Añade :floor al ID de un modelo para el proveedor más barato o :nitro para el más rápido.
ja: モデルIDに:floorを付けると最安のプロバイダー、:nitroを付けると最速のプロバイダーを使います。
zh_hans: 在模型 ID 后添加 :floor 选择费用最低的服务商，或添加 :nitro 选择最快的服务商。

# settings.remoteAgent.model.placeholder
source: e.g. llama3
es: p. ej., llama3
ja: 例：llama3
zh_hans: 例如 llama3

# settings.remoteAgent.model.placeholder.hosted
source: e.g. anthropic/claude-opus-4
es: p. ej., anthropic/claude-opus-4
ja: 例：anthropic/claude-opus-4
zh_hans: 例如 anthropic/claude-opus-4

# settings.remoteAgent.model.suggestions.empty
source: No models yet — run Test Connection to load them.
es: Aún no hay modelos: ejecuta Probar conexión para cargarlos.
ja: モデルはまだありません。「接続をテスト」で読み込んでください。
zh_hans: 尚无模型，请运行“测试连接”载入。

# settings.remoteAgent.model.suggestions.empty.v2
source: Model suggestions haven’t been loaded. Test the connection to load them.
es: No se han cargado las sugerencias de modelos. Prueba la conexión para cargarlas.
ja: モデル候補は未読み込みです。接続をテストして読み込んでください。
zh_hans: 模型建议尚未载入，请测试连接以载入。

# settings.remoteAgent.model.suggestions.filter.placeholder
source: Filter models
es: Filtrar modelos
ja: モデルを絞り込み
zh_hans: 筛选模型

# settings.remoteAgent.model.suggestions.header
source: Available models
es: Modelos disponibles
ja: 利用できるモデル
zh_hans: 可用模型

# settings.remoteAgent.model.suggestions.loading
source: Loading models…
es: Cargando modelos…
ja: モデルを読み込み中…
zh_hans: 正在载入模型…

# settings.remoteAgent.model.suggestions.noMatch
source: No models match your filter.
es: Ningún modelo coincide con tu filtro.
ja: 条件に一致するモデルはありません。
zh_hans: 没有符合筛选条件的模型。

# settings.remoteAgent.openRouter.reuse.button
source: Use my voice key
es: Usar mi clave de voz
ja: 音声用のキーを使用
zh_hans: 使用我的语音密钥

# settings.remoteAgent.openRouter.reuse.title
source: You've already set up OpenRouter for voice. Reuse that API key here?
es: Ya configuraste OpenRouter para voz. ¿Reutilizar esa clave de API aquí?
ja: 音声用にOpenRouterを設定済みです。そのAPIキーをここでも使いますか？
zh_hans: 已为语音设置 OpenRouter，要在此复用该 API 密钥吗？

# settings.remoteAgent.openRouter.signIn.discarded
source: The key you signed in with still exists in your OpenRouter account.
es: La clave con la que iniciaste sesión sigue existiendo en tu cuenta de OpenRouter.
ja: サインインに使ったキーは、OpenRouterアカウントに引き続き存在します。
zh_hans: 用于登录的密钥仍保留在 OpenRouter 账户中。

# settings.remoteAgent.openRouter.signIn.discardedDismiss
source: Dismiss
es: Cerrar
ja: 閉じる
zh_hans: 关闭

# settings.remoteAgent.openRouter.signIn.invalidCallback
source: The sign-in didn't come back the way Conduck expected. Try again, or paste an API key.
es: El inicio de sesión no regresó como esperaba Conduck. Inténtalo de nuevo o pega una clave de API.
ja: サインインの結果を正しく受け取れませんでした。再試行するか、APIキーを貼り付けてください。
zh_hans: 登录回调不符合 Conduck 的预期。请重试，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.manage
source: Manage on OpenRouter
es: Gestionar en OpenRouter
ja: OpenRouterで管理
zh_hans: 在 OpenRouter 管理

# settings.remoteAgent.openRouter.signIn.missingKey
source: That OpenRouter sign-in is no longer available. Sign in again, or paste an API key.
es: Ese inicio de sesión de OpenRouter ya no está disponible. Vuelve a iniciar sesión o pega una clave de API.
ja: このOpenRouterのサインインは利用できなくなりました。再度サインインするか、APIキーを貼り付けてください。
zh_hans: 该 OpenRouter 登录已失效。请重新登录，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.network
source: Couldn't reach OpenRouter. Check your connection, or paste an API key.
es: No se pudo conectar con OpenRouter. Comprueba tu conexión o pega una clave de API.
ja: OpenRouterに接続できませんでした。接続を確認するか、APIキーを貼り付けてください。
zh_hans: 无法连接 OpenRouter。请检查网络连接，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.outcomeUnknown
source: OpenRouter didn't answer in time. If a new key appeared in your OpenRouter account, you can remove it there. Try again, or paste an API key.
es: OpenRouter no respondió a tiempo. Si apareció una clave nueva en tu cuenta de OpenRouter, puedes eliminarla allí. Inténtalo de nuevo o pega una clave de API.
ja: OpenRouterが時間内に応答しませんでした。アカウントに新しいキーが作成されている場合は、そこで削除できます。再試行するか、APIキーを貼り付けてください。
zh_hans: OpenRouter 未及时响应。如果账户中出现了新密钥，你可以在那里移除它。请重试，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.rateLimited
source: OpenRouter is rate-limiting sign-ins. Wait a moment, or paste an API key.
es: OpenRouter está limitando los inicios de sesión. Espera un momento o pega una clave de API.
ja: OpenRouterのサインイン制限がかかっています。少し待つか、APIキーを貼り付けてください。
zh_hans: OpenRouter 正在限制登录频率。请稍等，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.rejected
source: OpenRouter didn't accept the sign-in. Try again, or paste an API key.
es: OpenRouter no aceptó el inicio de sesión. Inténtalo de nuevo o pega una clave de API.
ja: OpenRouterがサインインを受け付けませんでした。再試行するか、APIキーを貼り付けてください。
zh_hans: OpenRouter 未接受登录。请重试，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.staged
source: Signed in with OpenRouter
es: Sesión iniciada con OpenRouter
ja: OpenRouterでサインインしました
zh_hans: 已通过 OpenRouter 登录

# settings.remoteAgent.openRouter.signIn.stagedDetail
source: A new API key now sits in your OpenRouter account.
es: Ahora hay una clave de API nueva en tu cuenta de OpenRouter.
ja: OpenRouterアカウントに新しいAPIキーが作成されました。
zh_hans: OpenRouter 账户中已有新的 API 密钥。

# settings.remoteAgent.openRouter.signIn.unavailable
source: Conduck couldn't start a secure sign-in on this device. Paste an API key instead.
es: Conduck no pudo iniciar una sesión segura en este dispositivo. Pega una clave de API.
ja: このデバイスで安全なサインインを開始できませんでした。代わりにAPIキーを貼り付けてください。
zh_hans: Conduck 无法在此设备上启动安全登录，请改为粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.unexpected
source: OpenRouter answered in a way Conduck didn't expect. Try again, or paste an API key.
es: OpenRouter respondió de una forma inesperada para Conduck. Inténtalo de nuevo o pega una clave de API.
ja: OpenRouterから予期しない応答が返されました。再試行するか、APIキーを貼り付けてください。
zh_hans: OpenRouter 的响应不符合 Conduck 的预期。请重试，或粘贴 API 密钥。

# settings.remoteAgent.openRouter.signIn.useDifferentKey
source: Use a different key
es: Usar otra clave
ja: 別のキーを使用
zh_hans: 使用其他密钥

# settings.remoteAgent.quickConnect.dirtyGate
source: Save or discard your changes before reconnecting.
es: Guarda o descarta tus cambios antes de volver a conectar.
ja: 再接続する前に、変更を保存するか破棄してください。
zh_hans: 重新连接前请保存或放弃更改。

# settings.remoteAgent.quickConnect.label
source: Quick connect
es: Conexión rápida
ja: クイック接続
zh_hans: 快速连接

# settings.remoteAgent.quickConnect.setUp
source: Set up
es: Configurar
ja: 設定
zh_hans: 设置

# settings.remoteAgent.quickConnect.setUpAgain
source: Set up again
es: Configurar de nuevo
ja: 再設定
zh_hans: 重新设置

# settings.remoteAgent.reuse.change
source: Change
es: Cambiar
ja: 変更
zh_hans: 更改

# settings.remoteAgent.reuse.missingVoiceKey
source: The OpenRouter voice key isn't available. Paste an API key instead.
es: La clave de voz de OpenRouter no está disponible. Pega una clave de API.
ja: OpenRouterの音声用キーを利用できません。代わりにAPIキーを貼り付けてください。
zh_hans: OpenRouter 语音密钥不可用，请改为粘贴 API 密钥。

# settings.remoteAgent.reuse.saveFailed
source: Couldn't save the key. Try again.
es: No se pudo guardar la clave. Inténtalo de nuevo.
ja: キーを保存できませんでした。再試行してください。
zh_hans: 无法保存密钥，请重试。

# settings.remoteAgent.reuse.selected
source: OpenRouter voice key selected
es: Clave de voz de OpenRouter seleccionada
ja: OpenRouterの音声用キーを選択済み
zh_hans: 已选择 OpenRouter 语音密钥

# settings.remoteAgent.save.needsModel
source: Pick a model to save.
es: Elige un modelo para guardar.
ja: 保存するモデルを選んでください。
zh_hans: 请选择要保存的模型。

# settings.remoteAgent.section.footer.hosted
source: Hosted by OpenRouter, not your own server.
es: Alojado por OpenRouter, no en tu propio servidor.
ja: 自分のサーバーではなく、OpenRouterがホストします。
zh_hans: 由 OpenRouter 托管，而非自己的服务器。

# settings.remoteAgent.section.title
source: Personal AI
es: IA personal
ja: パーソナルAI
zh_hans: 个人 AI

# settings.remoteAgent.sessionPolicy.alwaysContinue
source: Always
es: Siempre
ja: 常に
zh_hans: 始终

# settings.remoteAgent.sessionPolicy.alwaysNew
source: Never
es: Nunca
ja: しない
zh_hans: 从不

# settings.remoteAgent.sessionPolicy.label
source: Add to last conversation
es: Añadir a la última conversación
ja: 前回の会話に追加
zh_hans: 添加到上次对话

# settings.remoteAgent.sessionPolicy.minutes15
source: If within 15 min
es: Si han pasado menos de 15 min
ja: 15分以内なら
zh_hans: 15 分钟以内

# settings.remoteAgent.sessionPolicy.minutes30
source: If within 30 min
es: Si han pasado menos de 30 min
ja: 30分以内なら
zh_hans: 30 分钟以内

# settings.remoteAgent.sessionPolicy.minutes60
source: If within 60 min
es: Si han pasado menos de 60 min
ja: 60分以内なら
zh_hans: 60 分钟以内

# settings.remoteAgent.setupOtherDevice.button
source: Set up on another device
es: Configurar en otro dispositivo
ja: 別のデバイスで設定
zh_hans: 在另一设备上设置

# settings.remoteAgent.showSetupCode.button
source: Show Gateway Setup Code
es: Mostrar código de configuración de la pasarela
ja: ゲートウェイの設定コードを表示
zh_hans: 显示网关设置代码

# settings.remoteAgent.showSetupCode.footer
source: Set up another device by scanning or pasting a code. The code holds this gateway's sensitive information, so treat it like a password.
es: Configura otro dispositivo escaneando o pegando un código. El código contiene información sensible de esta pasarela, así que trátalo como una contraseña.
ja: コードをスキャンまたは貼り付けて、別のデバイスを設定できます。ゲートウェイの機密情報を含むため、パスワードと同じように扱ってください。
zh_hans: 扫描或粘贴代码来设置另一设备。代码包含此网关的敏感信息，请像密码一样保管。

# settings.remoteAgent.summary.category.custom
source: Custom gateway
es: Pasarela personalizada
ja: カスタムゲートウェイ
zh_hans: 自定义网关

# settings.remoteAgent.summary.category.fullAgent
source: Full agent gateway
es: Pasarela de agente completa
ja: 完全なエージェントゲートウェイ
zh_hans: 完整智能体网关

# settings.remoteAgent.summary.category.hosted
source: Hosted model
es: Modelo alojado
ja: ホスト型モデル
zh_hans: 托管模型

# settings.remoteAgent.summary.checking
source: Checking connection…
es: Comprobando conexión…
ja: 接続を確認中…
zh_hans: 正在检查连接…

# settings.remoteAgent.summary.failed
source: Needs attention
es: Necesita atención
ja: 確認が必要
zh_hans: 需要处理

# settings.remoteAgent.summary.failedUnsaved
source: Needs attention · Unsaved changes
es: Necesita atención · Cambios sin guardar
ja: 確認が必要 · 未保存の変更
zh_hans: 需要处理 · 有未保存的更改

# settings.remoteAgent.summary.notSetUp
source: Not set up
es: Sin configurar
ja: 未設定
zh_hans: 未设置

# settings.remoteAgent.summary.passed
source: Test passed
es: Prueba superada
ja: テスト成功
zh_hans: 测试通过

# settings.remoteAgent.summary.passedSaveRequired
source: Test passed · Save required
es: Prueba superada · Hay que guardar
ja: テスト成功 · 保存が必要
zh_hans: 测试通过 · 需要保存

# settings.remoteAgent.summary.saved
source: Saved
es: Guardado
ja: 保存済み
zh_hans: 已保存

# settings.remoteAgent.summary.unsaved
source: Unsaved connection changes
es: Cambios de conexión sin guardar
ja: 未保存の接続変更
zh_hans: 连接更改未保存

# settings.remoteAgent.testConnection.button
source: Test Connection
es: Probar conexión
ja: 接続をテスト
zh_hans: 测试连接

# settings.remoteAgent.testConnection.button.instance
source: Test %@
es: Probar %@
ja: %@をテスト
zh_hans: 测试 %@
